<?php
header('content-type:text/html;charset=utf-8');
echo "Задача 2: <p>Опишете с PHP програма за изчисляване на периметъра и лицето на
различни геометрични форми.</p>";
echo "<p>Вариан 1:</p>";

$n = 3.14;
$r = 5;
$C = 2*$n*$r;
$S = $n*($r*$r);

echo "п = " .$n. "<p> r =" .$r. "  </p> <p> C = ? </p> <p> S = ? </p>";
echo "<p>Решение : C = 2 . п . r = 2 . $n . $r = $C </p>";
echo "<p> S = п . (r .r) = $n . ($r . $r) = $S </p>";
echo "<p>Вариан 2:</p>";

$n = 3.14;
$r = 3;
$C = 2*$n*$r;
$S = $n*($r*$r);

echo "п = " .$n. "<p> r =" .$r. "  </p> <p> C = ? </p> <p> S = ? </p>";
echo "<p>Решение : C = 2 . п . r = 2 . $n . $r = $C </p>";
echo "<p> S = п . (r .r) = $n . ($r . $r) = $S </p>";
echo "<p>Вариан 3:</p>";

$n = 3.14;
$r = 8;
$C = 2*$n*$r;
$S = $n*($r*$r);

echo "п = " .$n. "<p> r =" .$r. "  </p> <p> C = ? </p> <p> S = ? </p>";
echo "<p>Решение : C = 2 . п . r = 2 . $n . $r = $C </p>";
echo "<p> S = п . (r .r) = $n . ($r . $r) = $S </p>";

